cask_args appdir: "/Applications"

brew "gh"
brew "jq"
brew "mas"
brew "mysql-client"
brew "tcptraceroute"
brew "terminal-notifier"
brew "tfenv"
brew "tmux"
brew "tree"
brew "ripgrep"
brew "neovim"
brew "prettier"
brew "mas"
brew "node@14"
brew "node@16"
brew "php"
brew "php@7.4"
brew "php@8.0"
brew "python@3.8"
brew "typescript"

# Go
brew "gopls"
brew "go@1.18"

cask "alfred"
cask "appcleaner"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "mysqlworkbench"
cask "visual-studio-code"
cask "dbeaver-community"
cask "dash"
cask "homebrew/cask/anki"
cask "ngrok"
cask "neovide"

tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

mas 'Dashlane', id: 517914548
